# running in harness/src/
read_verilog -sv BorbRvfiWrapper.sv
read_verilog CPU.v
prep -top BorbRvfiWrapper

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
